In [20]:
import numpy as np
import random
import names as rn
import pandas as pd

In [56]:
categories = ['Student','Teacher','Lecturer','Admin']
p = [0.6,0.15,0.15,0.10]
size = 100

In [68]:
role = np.random.choice(p=p,a=categories,size=size)
names = [rn.get_first_name() for i in range(size)]
id_ = np.arange(1,101,1)
height = np.round(4 * np.random.randn(100) + 60,1)

In [69]:
my_records = pd.DataFrame(columns = ['id','role','names','height'])
my_records.id,my_records.role,my_records.names,my_records.height = id_,role,names,height

In [70]:
my_records

     id      role    names  height
0     1   Student     Nora    56.0
1     2     Admin  Lorinda    58.5
2     3   Teacher   Nellie    57.1
3     4   Student   Eugene    59.3
4     5   Teacher     John    61.5
..  ...       ...      ...     ...
95   96   Student      Eva    63.2
96   97  Lecturer     Lisa    56.2
97   98   Student    Debra    61.4
98   99   Student   Arnold    61.5
99  100   Student     Lois    58.2

[100 rows x 4 columns]